TestCases/MoistureFluxBC/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
        #include "interpolationTable.H"
    #};

    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};

    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
        scalarField T(mesh.nCells(), scalar(0));
        
        // Temperature profile data (z vs thl)
        List<Tuple2<scalar, scalar>> profileData =
        {
            {12.5, 289.1929983716404},
            {37.5, 289.11455942665737},
            {62.5, 289.1086844208876},
            {87.5, 289.2034658821045},
            {112.5, 289.4565147406901},
            {137.5, 289.93305217123685},
            {162.5, 290.7156239871247},
            {187.5, 291.5624513353687},
            {212.5, 292.4189542415097},
            {237.5, 293.14623944735905},
            {262.5, 293.78354772787776},
            {287.5, 294.3412115621487},
            {312.5, 294.7903267523895},
            {337.5, 295.2062566764404},
            {362.5, 295.5258129946911},
            {387.5, 295.8264746751143},
            {412.5, 296.07013687881056},
            {437.5, 296.2926215821812},
            {462.5, 296.5013957453687},
            {487.5, 296.6921323185333},
            {512.5, 296.88286889169785},
            {537.5, 297.0779479135755},
            {562.5, 297.2733539165129},
            {587.5, 297.4730488030635},
            {612.5, 297.68905762348345},
            {637.5, 297.9050664439034},
            {662.5, 298.1279586965962},
            {687.5, 298.37152979437656},
            {712.5, 298.6151008921569},
            {737.5, 298.8594515366399},
            {762.5, 299.12396878836574},
            {787.5, 299.38848604009155},
            {812.5, 299.6530032918174},
            {837.5, 299.9228987268039},
            {862.5, 300.1971694331102},
            {887.5, 300.47144013941653},
            {912.5, 300.7457108457229},
            {937.5, 300.98861334799176},
            {962.5, 301.22227030290264},
            {987.5, 301.4559272578136},
            {1012.5, 301.68958421272447},
            {1037.5, 301.867431519503},
            {1062.5, 302.01903820989577},
            {1087.5, 302.17064490028855},
            {1112.5, 302.32225159068133},
            {1137.5, 302.4713670906128},
            {1162.5, 302.6132760900441},
            {1187.5, 302.75518508947545},
            {1212.5, 302.8970940889068},
            {1237.5, 303.0390030883381},
            {1262.5, 303.20393119886285},
            {1287.5, 303.39320481077635},
            {1312.5, 303.5824784226899},
            {1337.5, 303.7717520346035},
            {1362.5, 303.961025646517},
            {1387.5, 304.15841143084083},
            {1412.5, 304.3708821179199},
            {1437.5, 304.583352804999},
            {1462.5, 304.79582349207806},
            {1487.5, 305.0082941791571},
            {1512.5, 305.22076486623615},
            {1537.5, 305.4276915092688},
            {1562.5, 305.6334761370017},
            {1587.5, 305.8392607647346},
            {1612.5, 306.0450453924675},
            {1637.5, 306.2508300202004},
            {1662.5, 306.45661464793324},
            {1687.5, 306.649470939789},
            {1712.5, 306.8409863639723},
            {1737.5, 307.0325017881556},
            {1762.5, 307.2240172123389},
            {1787.5, 307.4155326365222},
            {1812.5, 307.60704806070544},
            {1837.5, 307.7883292773228},
            {1862.5, 307.9616826062864},
            {1887.5, 308.1350359352499},
            {1912.5, 308.3083892642135},
            {1937.5, 308.48174259317705},
            {1962.5, 308.6550959221406},
            {1987.5, 308.82844925110413},
            {2012.5, 308.9856723544193},
            {2037.5, 309.1385495152348},
            {2062.5, 309.2914266760502},
            {2087.5, 309.4443038368657},
            {2112.5, 309.59718099768116},
            {2137.5, 309.7500581584966},
            {2162.5, 309.90293531931206},
            {2187.5, 310.04386799932024},
            {2212.5, 310.1757465428033},
            {2237.5, 310.30762508628635},
            {2262.5, 310.43950362976943},
            {2287.5, 310.57138217325246},
            {2312.5, 310.70326071673554},
            {2337.5, 310.8351392602186},
            {2362.5, 310.96701780370165},
            {2387.5, 311.0797229636396},
            {2412.5, 311.19031541458486},
            {2437.5, 311.3009078655302},
            {2462.5, 311.41150031647544},
            {2487.5, 311.5220927674207},
            {2512.5, 311.63268521836596},
            {2537.5, 311.7432776693112},
            {2562.5, 311.85387012025654},
            {2587.5, 311.94798831892706},
            {2612.5, 312.03750590286154},
            {2637.5, 312.1270234867961},
            {2662.5, 312.21654107073056},
            {2687.5, 312.3060586546651},
            {2712.5, 312.39557623859963},
            {2737.5, 312.4850938225341},
            {2762.5, 312.57461140646865},
            {2787.5, 312.66049804669046},
            {2812.5, 312.7330697264611},
            {2837.5, 312.80564140623176},
            {2862.5, 312.87821308600235},
            {2887.5, 312.950784765773},
            {2912.5, 313.02335644554364},
            {2937.5, 313.0959281253143},
            {2962.5, 313.1684998050849},
            {2987.5, 313.2410714848555},
            {3012.5, 313.3117353956889},
            {3037.5, 313.37502704677433},
            {3062.5, 313.4383186978597},
            {3087.5, 313.5016103489451},
            {3112.5, 313.5649020000305},
            {3137.5, 313.6281936511159},
            {3162.5, 313.6914853022013},
            {3187.5, 313.75477695328664},
            {3212.5, 313.81806860437206},
            {3237.5, 313.8813602554574},
            {3262.5, 313.9434142056047},
            {3287.5, 314.0050912657332},
            {3312.5, 314.0667683258617},
            {3337.5, 314.1284453859902},
            {3362.5, 314.19012244611866},
            {3387.5, 314.25179950624715},
            {3412.5, 314.31347656637564},
            {3437.5, 314.37515362650413},
            {3462.5, 314.4368306866326},
            {3487.5, 314.4985077467611},
            {3512.5, 314.5588535143638},
            {3537.5, 314.619069758582},
            {3562.5, 314.67928600280015},
            {3587.5, 314.73950224701827},
            {3612.5, 314.79971849123643},
            {3637.5, 314.8599347354546},
            {3662.5, 314.9201509796727},
            {3687.5, 314.9803672238909},
            {3712.5, 315.040583468109},
            {3737.5, 315.10079971232716},
            {3762.5, 315.1572140371617},
            {3787.5, 315.2116552953264},
            {3812.5, 315.26609655349114},
            {3837.5, 315.32053781165587},
            {3862.5, 315.3749790698206},
            {3887.5, 315.4294203279853},
            {3912.5, 315.48386158615006},
            {3937.5, 315.5383028443148},
            {3962.5, 315.5927441024795},
            {3987.5, 315.64718536064424}
        };
        
        // Linear interpolation function, performs linear interpolation between data points
        // For heights between measured points, it calculates T using:
        // T = T1 + (T2 - T1) * (z - z1) / (z2 - z1)
        auto interpolate = [&](scalar z) -> scalar
        {
            // Handle heights below minimum data point
            if (z <= profileData.first().first()) 
                return profileData.first().second();
            
            // Handle heights above maximum data point  
            if (z >= profileData.last().first()) 
                return profileData.last().second();
                
            // Find the interval that contains this z-value
            for (label i = 0; i < profileData.size() - 1; ++i)
            {
                if (z >= profileData[i].first() && z <= profileData[i+1].first())
                {
                    scalar z1 = profileData[i].first();
                    scalar z2 = profileData[i+1].first();
                    scalar T1 = profileData[i].second();
                    scalar T2 = profileData[i+1].second();
                    
                    // Linear interpolation formula
                    return T1 + (T2 - T1) * (z - z1) / (z2 - z1);
                }
            }
            
            // Fallback - return last value
            return profileData.last().second();
        };

        // Assign temperature to each cell based on its z-coordinate (vertical)
        forAll(T, i)
        {
            const scalar z = mesh.C()[i].z(); // Now using z as vertical coordinate
            T[i] = interpolate(z);
        }        
        T.writeEntry("", os);
    #};
};

boundaryField
{
    earth
    {
        type            atmTurbulentHeatFluxTemperature;
        heatSource      flux;
        alphaEff        alphaEff; // coming from the solver buoyantBoussinesqPimpleFoam/TEqn.H (Line 5): volScalarField alphaEff("alphaEff", turbulence->nu()/Pr + alphat);
        Cp0             1227.32; // effectively rho * Cp = 1.22×1006 = 1227.32, as this BC doesn't directly consider the density in the denominator of ∇T = q/(rho*Cp*alphaEff).
        value           uniform 289.232; // surface temperature at IC, interpolated from 0/T: {12.5, 289.1929983716404},{37.5, 289.11455942665737}
        q               uniform 108.63;  // sensible heat flux in W/m²
    }
    cblTop
    {
        type            zeroGradient;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
